src/integ-test/bdd-test/resources/xml/nodoChiediCatalogoServizi_noOptional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pagamenti.telematici.gov/">
	<soapenv:Header/>
	<soapenv:Body>
		<ws:nodoChiediCatalogoServizi>
			<identificativoPSP>$identificativoPSP</identificativoPSP>
			<identificativoIntermediarioPSP>$identificativoIntermediarioPSP</identificativoIntermediarioPSP>
			<identificativoCanale>$identificativoCanale</identificativoCanale>
			<password>$password</password>
		</ws:nodoChiediCatalogoServizi>
	</soapenv:Body>
</soapenv:Envelope>